// ignore_for_file: unnecessary_brace_in_string_interps

import 'package:http/http.dart' as http;
import 'dart:convert';

import 'package:version_1/main.dart';

get(token, surl) async {
  try {
    var response = await http.get(Uri.parse("http://${url}/${surl}"),
        headers: {'Authorization': 'Bearer ${token}'});
    var l = jsonDecode(response.body);
    return l;
  } catch (e) {
    // ignore: avoid_print
    print(e);
  }
}

/*
List<article> articles = [
  article(
      1,
      "المضاعفات الناشئة من الحمل",
      "content1 content1 content1 content1 content1 content1 content1",
      "wikipedia.com",
      "2 سنة",
      "2/10/2022"),
  article(
      2,
      "المضاعفات الناشئة من الحمل في الأشهر الأولى",
      "أن تكون المشيمة متقدمة على الجنين: وهنا تكون المشيمة موجودة في الجزء الأسفل من الرحم أمام الجنين ويمكن تشخيص هذا الوضع بسهولة بواسطة السونار، وفي أغلب الأحيان لا يوجد سبب واضح لوجود المشيمة في هذا الجزء من الرحم، وينتج عن وجود المشيمة في مكانها غير الطبيعي نزيف الذي إما أن يكون بسيطاً أو يكون شديداً لدرجة مفزعة وعادةً ما يكون لون الدم أحمر قانياً، ولا يصاحب هذا النزيف في العادة أية آلام في البطن، ولكن لابد من إدخال الحامل التي تعاني من هذا النزيف المستشفى في كل الأحوال، وتعتمد الإجراءات التي قد يلجأ إليها الطبيب حسب حالة المريضة وشدة النزيف ومدة الحمل، فقد تبقى المريضة تحت المراقبة إن كان النزيف بسيطاً والحمل غير مكتمل، أو قد يلجأ إلى إجراء عملية قيصرية فورية إن كان النزيف شديداً أو الحمل مكتملاً. ولا بد في كل الأحوال من عملية نقل دم، بالإضافة لإجراء العملية القيصرية في نهاية الأمر لأن المشيمة تشكل حاجزاً أمام الجنين وتحول دون نزول الجنين في مجرى الولادة. أما إذا كان النزيف بسيطاً والحمل غير مكتمل وقرر الطبيب الانتظار، فيجب في هذه الحالة إبقاء الحامل تحت المراقبة في المستشفى إلى حين الولادة. لأن الحامل تكون معرضة في هذه الحالة للنزيف المفاجئ في أي وقت.أن تكون المشيمة منفصلة عن جدار الرحم قبل الولادة: ففي الحالة الطبيعية تنفصل المشيمة عن جدار الرحم بعد ولادة الطفل وأما انفصالها قبل ذلك يؤدي إلى مضاعفات تؤثر على الأم وعلى الجنين.",
      "facebook.com",
      "4 شهر",
      "5/10/2021"),
  article(3, "المضاعفات", "content3", "wikipedia.com", "1 سنة", "3/4/2022"),
  article(4, "الولادة", "content4", "twitter.com", "3 سنة", "14/5/2022"),
];
*/