List<Map<String, Object>> EventSet = [
  {
    'date': '5-1-2023',
    'events': [
      {
        'type': 4,
        'details':
            "يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر",
        'date': "10:05",
      },
      {
        'type': 5,
        'details': "يبلابيءرءؤرر",
        'date': "22:05",
      }
    ]
  },
  {
    'date': '6-1-2023',
    'events': [
      {'type': 0, 'details': "سلاسبلاربءر", 'date': "03.06"},
      {'type': 3, 'details': "يبلابير", 'date': "22:05 "},
      {'type': 4, 'details': "يبلابير", 'date': "16:55"}
    ]
  },
  {
    'date': '5-1-2023',
    'events': [
      {
        'type': 2,
        'details':
            "يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر",
        'date': "10:05",
      },
      {
        'type': 6,
        'details': "يبلابيءرءؤرر",
        'date': "22:05",
      }
    ]
  },
  {
    'date': '5-1-2023',
    'events': [
      {
        'type': 4,
        'details':
            "يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر يبلابي تا نتلانتلا نتلاى نتلا نالا ن ارلا تالا نلانت لانتى نتى تلاى نتلاى نالا نتلا نتلاى لبىر",
        'date': "10:05",
      },
      {
        'type': 1,
        'details': "يبلابيءرءؤرر",
        'date': "22:05",
      }
    ]
  },
];
